In [ ]:
import pandas as pd

# Load data
df = pd.read_csv("./ecommerce_orders_200_rows.csv")

df.head()

,Order_ID,Order_Date,Customer_ID,Gender,Age,Age_Group,City,State,Product_Category,Product_Name,Quantity,Price,Discount,Payment_Method,Order_Status
0,1001,2024-01-25,C022,Other,NaN,60+,Hyderabad,Telangana,Fashion,Jeans,2,2396,0.30,Net Banking,Returned
1,1002,2024-02-27,C108,Male,NaN,60+,Chennai,Tamil Nadu,Health,Protein Powder,3,1987,0.30,Net Banking,Cancelled
2,1003,2024-02-03,C024,Male,NaN,60+,Delhi,Delhi,Fashion,Jeans,3,3707,0.05,COD,Cancelled
3,1004,2024-02-12,C104,Male,60.0,60+,Mumbai,Maharashtra,Beauty,Skincare Kit,1,591,0.20,Credit Card,Cancelled
4,1005,2024-02-22,C009,Female,NaN,60+,Hyderabad,Telangana,Electronics,Headphones,1,4427,NaN,Credit Card,Returned

In [ ]:
df.shape

(200, 15)

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 15 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Order_ID          200 non-null    int64
 1   Order_Date        200 non-null    object
 2   Customer_ID       200 non-null    object
 3   Gender            200 non-null    object
 4   Age               101 non-null    float64
 5   Age_Group         200 non-null    object
 6   City              200 non-null    object
 7   State             200 non-null    object
 8   Product_Category  200 non-null    object
 9   Product_Name      200 non-null    object
 10  Quantity          200 non-null    int64
 11  Price             200 non-null    int64
 12  Discount          161 non-null    float64
 13  Payment_Method    200 non-null    object
 14  Order_Status      200 non-null    object
dtypes: float64(2), int64(3), object(10)
memory usage: 23.6+ KB

In [ ]:
# Missing values
df.isnull().sum()

Order_ID             0
Order_Date           0
Customer_ID          0
Gender               0
Age                 99
Age_Group            0
City                 0
State                0
Product_Category     0
Product_Name         0
Quantity             0
Price                0
Discount            39
Payment_Method       0
Order_Status         0
dtype: int64